org/map_matching.org
:PROPERTIES:
:ID:       011be61f-9934-4996-9c6c-328a19eaff96
:END:
#+title: Map Matching

Map matching compiles small numbers of consecutive scans into
local maps $m_{\mathrm{local}}$. Maps are then compared to the global
map $m$, such that the more similar $m$ and $m_{\mathrm{local}}$, the
larger $p(m_\mathrm{local} | x_t, m)$. Cells in the local map are
transformed to the coordinates of the global map, and the map
correlation function is computed.

Map matching is easy to compute, but does not yield smooth
probabilities in the pose parameter $x_t$. One solution is to convolve
the map with a Gaussian smoothness kernel before running map matching.

Map matching considers the free-space in the scoring of 2 maps,
compared to the [[id:bc31b36d-8a2e-492c-af48-75f7794eefa4][Likelihood Field Model]] which uses only the
end-points. 

* Issues

1. No plausible physical explanation
2. Result of map matching may incorporate areas beyond actual
   measurement range.
